/**
 ** Задача про список рекомендаций maxItemAssociation
 * Цель:
 * Написать алгоритм для нахождения максимального списка рекомендаций.
 * Это задание является достаточно сложным, однако может быть интересно тем, кто хочет попробовать свои силы с реальными примерами из реальных собеседований.
 * Если вы хотите попробовать решить менее сложную задачу, внизу можно найти задание 2. Решение любого из заданий достаточно для зачета этого ДЗ.
 * 
 * Задание 2.
 * Написать функцию sum, которая может быть исполнена любое количество раз с не undefined аргументом. Если она исполнена без аргументов, то возвращает значение суммы всех переданных до этого значений.
 * sum(1)(2)(3)....(n)() === 1 + 2 + 3 + ... + n
 * 
 * Критерии оценки:
 * 1.Факт свершения действия - ДЗ отправлена на проверку +1 балл
 * 2. Степень выполнения ДЗ +1 балл – результат скорее не достигнут, чем достигнут +2 баллов – результат скорее достигнут, чем не достигнут +3 балла – результат достигнут полностью
 * 3. Способ выполнения ДЗ +1 балл – использован неоптимальный способ достижения результата +2 балл – оптимальный способ достижения результата использован частично +3 балл -- использован наиболее оптимальный способ достижения результата
 * 4. Скорость выполнения ДЗ +1 балл - работа сдана под конец курса +2 балла - работа сдана с отставанием +3 балла - дедлайн соблюден
 * 
 * Статус "Принято" ставится при наборе 5 баллов
*/ 